tutorials/chemistryBenchmark/bases/yao-base/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 3.14159265;
convertToMeters 0.008;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

        upperBoundary
        {
                type cyclic;
                neighbourPatch lowerBoundary;
                faces
                (
                        (3 7 6 2)
                );
        }
        lowerBoundary
        {
                type cyclic;
                neighbourPatch upperBoundary;
                faces
                (
                        (1 5 4 0)
                );
        }
        leftBoundary
        {
                type cyclic;
                neighbourPatch rightBoundary;
                faces
                (
                        (0 4 7 3)
                );
        }

        rightBoundary
        {
                type cyclic;
                neighbourPatch leftBoundary;
                faces
                (
                        (2 6 5 1)
                );
        }
        front
        {
                type cyclic;
                neighbourPatch back;
                faces
                (
                        (0 3 2 1)              
                );
        }
        back
        {
                type cyclic;
                neighbourPatch front;
                faces
                (
                        (4 5 6 7)   
                );
        }

        
);

mergePatchPairs
(
);

// ************************************************************************* //
